System Info:
	Python version: 3.7.13 (default, Mar 29 2022, 02:18:16) 
[GCC 7.5.0]
	TensorFlow version: 2.4.1
	Keras version: 2.4.0

Training Info:
	Loss Function: mean_absolute_error
	Optimisation Method: Adam
	Learning Rate: 0.001
	Batch Size: 128
	Number of Epochs: 100

Training Results:
	Loss: 0.001039581373333931
	Rse: 0.062119290232658386
	Corr: 0.9087743163108826

Validation Results:
	Loss: 0.0009759567328728735
	Rse: 0.07201700657606125
	Corr: nan

Model Summary:
	Model: "model"
	__________________________________________________________________________________________________
	Layer (type)                    Output Shape         Param #     Connected to                     
	==================================================================================================
	input_1 (InputLayer)            [(None, 35, 74)]     0                                            
	__________________________________________________________________________________________________
	reshape (Reshape)               (None, 35, 74, 1)    0           input_1[0][0]                    
	__________________________________________________________________________________________________
	conv2d (Conv2D)                 (None, 30, 1, 100)   44500       reshape[0][0]                    
	__________________________________________________________________________________________________
	dropout (Dropout)               (None, 30, 1, 100)   0           conv2d[0][0]                     
	__________________________________________________________________________________________________
	reshape_1 (Reshape)             (None, 30, 100)      0           dropout[0][0]                    
	__________________________________________________________________________________________________
	pre_skip_trans (PreSkipTrans)   (None, 7, 100)       0           reshape_1[0][0]                  
	__________________________________________________________________________________________________
	gru (GRU)                       [(None, 100), (None, 60600       reshape_1[0][0]                  
	__________________________________________________________________________________________________
	gru_1 (GRU)                     [(None, 5), (None, 5 1605        pre_skip_trans[0][0]             
	__________________________________________________________________________________________________
	dropout_1 (Dropout)             (None, 100)          0           gru[0][1]                        
	__________________________________________________________________________________________________
	post_skip_trans (PostSkipTrans) (None, 20)           0           gru_1[0][1]                      
	                                                                 input_1[0][0]                    
	__________________________________________________________________________________________________
	pre_ar_trans (PreARTrans)       (None, 5)            0           input_1[0][0]                    
	__________________________________________________________________________________________________
	concatenate (Concatenate)       (None, 120)          0           dropout_1[0][0]                  
	                                                                 post_skip_trans[0][0]            
	__________________________________________________________________________________________________
	flatten_1 (Flatten)             (None, 5)            0           pre_ar_trans[0][0]               
	__________________________________________________________________________________________________
	flatten (Flatten)               (None, 120)          0           concatenate[0][0]                
	__________________________________________________________________________________________________
	dense_1 (Dense)                 (None, 1)            6           flatten_1[0][0]                  
	__________________________________________________________________________________________________
	dense (Dense)                   (None, 74)           8954        flatten[0][0]                    
	__________________________________________________________________________________________________
	post_ar_trans (PostARTrans)     (None, 74)           0           dense_1[0][0]                    
	                                                                 input_1[0][0]                    
	__________________________________________________________________________________________________
	add (Add)                       (None, 74)           0           dense[0][0]                      
	                                                                 post_ar_trans[0][0]              
	==================================================================================================
	Total params: 115,665
	Trainable params: 115,665
	Non-trainable params: 0
	__________________________________________________________________________________________________
